### Terraform Plan Output:

```
aws_iam_role.glue_role: Refreshing state... [id=glue-role-prod]
aws_iam_role.airflow_role: Refreshing state... [id=airflow-ec2-role]
aws_s3_object.marketing_data_simulation: Refreshing state... [id=scripts/python_shell/sample-meta-gen.py]
aws_s3_object.data_consumption_social_media_meta_script: Refreshing state... [id=scripts/glue/data-consumption-meta-month.py]
aws_key_pair.airflow_key_w: Refreshing state... [id=airflow-key-no-pass]
data.aws_caller_identity.current: Reading...
aws_s3_object.data_transformation_social_media_script: Refreshing state... [id=scripts/glue/data-transformation-social-media.py]
aws_vpc.airflow_vpc: Refreshing state... [id=vpc-057ca11e482b7e437]
aws_iam_policy.glue_s3_prefix_policy: Refreshing state... [id=arn:aws:iam::654654560187:policy/glue-s3-prefix-policy]
data.aws_caller_identity.current: Read complete after 0s [id=654654560187]
aws_iam_policy.airflow_dag_extended_permissions: Refreshing state... [id=arn:aws:iam::654654560187:policy/AirflowDagCommonActions]
aws_iam_role_policy_attachment.airflow_extended: Refreshing state... [id=airflow-ec2-role-20250510210855281700000001]
aws_iam_role_policy.ssm_read_airflow_admin: Refreshing state... [id=airflow-ec2-role:AirflowSSMReadAccess]
aws_iam_instance_profile.airflow_instance_profile: Refreshing state... [id=airflow-ec2-profile]
aws_iam_role_policy_attachment.glue_console_access: Refreshing state... [id=glue-role-prod-20250510062649864900000002]
aws_iam_role_policy_attachment.glue_service_role: Refreshing state... [id=glue-role-prod-20250510062649993400000004]
aws_glue_job.simulate_marketing_data: Refreshing state... [id=sdata-ingestion-social-media]
aws_glue_job.data_consumption_social_media_meta: Refreshing state... [id=data-consumption-social-media-meta]
aws_iam_role_policy_attachment.glue_custom_s3_access: Refreshing state... [id=glue-role-prod-20250510062649851000000001]
aws_glue_job.data_transformation_social_media: Refreshing state... [id=data-transformation-social-media]
aws_iam_role_policy_attachment.athena_full_access: Refreshing state... [id=glue-role-prod-20250510062649979700000003]
aws_subnet.public_subnet_1: Refreshing state... [id=subnet-05f98da85570d76ef]
aws_internet_gateway.igw: Refreshing state... [id=igw-0314a72b56c20dc6a]
aws_route_table.public_rt: Refreshing state... [id=rtb-05aee19d22469812b]
aws_subnet.public_subnet_2: Refreshing state... [id=subnet-0abe80bc28cef751c]
aws_security_group.airflow_sg: Refreshing state... [id=sg-01b4eff178d7125ad]
aws_route.default_route: Refreshing state... [id=r-rtb-05aee19d22469812b1080289494]
aws_route_table_association.public_rt_assoc: Refreshing state... [id=rtbassoc-0e4e8f201a25e43ae]
aws_db_subnet_group.airflow_subnets: Refreshing state... [id=airflow-subnet-group]
aws_instance.airflow: Refreshing state... [id=i-0406fe11371373133]
aws_instance.airflow_scheduler: Refreshing state... [id=i-085a77a7c3278a7e3]
aws_db_instance.airflow_rds: Refreshing state... [id=db-2BNO3QWCLIJVK2DCWBZQKMCIAY]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.glue_jobs.aws_glue_job.el_01_simulate_multiples_tables will be created
  + resource "aws_glue_job" "el_01_simulate_multiples_tables" {
      + arn               = (known after apply)
      + default_arguments = {
          + "--TempDir" = "s3://fcorp-data-prod/temp/"
        }
      + description       = "Script to create 4 tables from 1 file to simulate data from several sources"
      + glue_version      = "3.0"
      + id                = (known after apply)
      + max_capacity      = 0.0625
      + max_retries       = 1
      + name              = "01-simulate-multiples-tables"
      + number_of_workers = (known after apply)
      + role_arn          = "arn:aws:iam::654654560187:role/glue-role-prod"
      + tags              = {
          + "Environment" = "prod"
          + "Project"     = "fcorp"
        }
      + tags_all          = {
          + "Environment" = "prod"
          + "Project"     = "fcorp"
        }
      + timeout           = (known after apply)
      + worker_type       = (known after apply)

      + command {
          + name            = "pythonshell"
          + python_version  = "3.9"
          + runtime         = (known after apply)
          + script_location = "s3://fcorp-data-prod/scripts/python_shell/01-simulate-multiples-tables.py"
        }
    }

  # module.glue_jobs.aws_glue_job.el_02_data_clean_big_table will be created
  + resource "aws_glue_job" "el_02_data_clean_big_table" {
      + arn               = (known after apply)
      + description       = "Glue job to get policies data from several files, clean them and create a one big table"
      + glue_version      = "4.0"
      + id                = (known after apply)
      + max_capacity      = (known after apply)
      + max_retries       = 1
      + name              = "02-data-clean-big-table"
      + number_of_workers = 2
      + role_arn          = "arn:aws:iam::654654560187:role/glue-role-prod"
      + tags              = {
          + "Environment" = "prod"
          + "Project"     = "fcorp"
        }
      + tags_all          = {
          + "Environment" = "prod"
          + "Project"     = "fcorp"
        }
      + timeout           = (known after apply)
      + worker_type       = "G.1X"

      + command {
          + name            = "glueetl"
          + python_version  = "3"
          + runtime         = (known after apply)
          + script_location = "s3://fcorp-data-prod/scripts/glue/02-data-clean-big-table.py"
        }
    }

  # module.glue_jobs.aws_glue_job.el_03_policies_consumption will be created
  + resource "aws_glue_job" "el_03_policies_consumption" {
      + arn               = (known after apply)
      + description       = "Glue job to get policies data from clean stage, applies transformations and write on consumption stage"
      + glue_version      = "4.0"
      + id                = (known after apply)
      + max_capacity      = (known after apply)
      + max_retries       = 1
      + name              = "03-policies-consumption"
      + number_of_workers = 2
      + role_arn          = "arn:aws:iam::654654560187:role/glue-role-prod"
      + tags              = {
          + "Environment" = "prod"
          + "Project"     = "fcorp"
        }
      + tags_all          = {
          + "Environment" = "prod"
          + "Project"     = "fcorp"
        }
      + timeout           = (known after apply)
      + worker_type       = "G.1X"

      + command {
          + name            = "glueetl"
          + python_version  = "3"
          + runtime         = (known after apply)
          + script_location = "s3://fcorp-data-prod/scripts/glue/03-policies-consumption.py"
        }
    }

  # module.glue_jobs.aws_s3_object.aws_load_01_simulate_multiples_tables will be created
  + resource "aws_s3_object" "aws_load_01_simulate_multiples_tables" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "fcorp-data-prod"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "014b57abb0eca56d3790feaf52c41c0b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "scripts/python_shell/01-simulate-multiples-tables.py"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../../jobs/policies/01-simulate-multiples-tables.py"
      + storage_class          = (known after apply)
      + tags                   = {
          + "Environment" = "prod"
          + "Project"     = "fcorp"
        }
      + tags_all               = {
          + "Environment" = "prod"
          + "Project"     = "fcorp"
        }
      + version_id             = (known after apply)
    }

  # module.glue_jobs.aws_s3_object.aws_load_02_data_clean_big_table will be created
  + resource "aws_s3_object" "aws_load_02_data_clean_big_table" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "fcorp-data-prod"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "cbe2a32eac0ebbda5cfc45e8cd937d1c"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "scripts/glue/02-data-clean-big-table.py"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../../jobs/policies/02-data-clean-big-table.py"
      + storage_class          = (known after apply)
      + tags                   = {
          + "Environment" = "prod"
          + "Project"     = "fcorp"
        }
      + tags_all               = {
          + "Environment" = "prod"
          + "Project"     = "fcorp"
        }
      + version_id             = (known after apply)
    }

  # module.glue_jobs.aws_s3_object.aws_load_03_policies_consumption will be created
  + resource "aws_s3_object" "aws_load_03_policies_consumption" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "fcorp-data-prod"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "4ead839f63f6e6f449dfbcf875732bc6"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "scripts/glue/03-policies-consumption.py"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../../jobs/policies/03-policies-consumption.py"
      + storage_class          = (known after apply)
      + tags                   = {
          + "Environment" = "prod"
          + "Project"     = "fcorp"
        }
      + tags_all               = {
          + "Environment" = "prod"
          + "Project"     = "fcorp"
        }
      + version_id             = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```